---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.BuiltInFailures.SkylightFailures
source: html/8d7793b2-f6e4-ca3a-c276-a3b25f7a7d89.htm
---
# BuiltInFailures.SkylightFailures Members

Provides a container of all Revit built-in FailureDefinitionId instances.